# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [30]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [79]:
orders=pd.read_csv("C:/Users/milena.xavier/Documents/Orders/Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [94]:
total_sales=orders.groupby(['CustomerID']).agg({"amount_spent": "sum"})

labels1=["others", "Preferred", "VIP"]
total_sales["Category"]=pd.qcut(total_sales['amount_spent'], [0, 0.75, 0.95, 1], labels=labels1)
total_sales.sort_values(by="amount_spent", ascending=False)

            amount_spent Category
CustomerID
14646          280206.02      VIP
18102          259657.30      VIP
17450          194550.79      VIP
16446          168472.50      VIP
14911          143825.06      VIP
...                  ...      ...
17956              12.75   others
16454               6.90   others
14792               6.20   others
16738               3.75   others
13256               0.00   others

[4339 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [153]:
total_sales_country = pd.merge(total_sales, orders, how='inner', on = 'CustomerID').reset_index()
condition=total_sales_country['Category']=='VIP'
total_sales_country[condition]

total_sales_country_agg=total_sales_country[condition].groupby(["Country"])["CustomerID"].nunique().reset_index(name='Unique_Customers').sort_values(by=('Unique_Customers'), ascending=False)
total_sales_country_agg


#total_sales_country_agg_VIP=total_sales_country_agg.query("Category=='VIP'")
#total_sales_country_agg_VIP.sort_values

            Country  Unique_Customers
17   United Kingdom               177
8           Germany                10
7            France                 9
16      Switzerland                 3
14            Spain                 2
12         Portugal                 2
0         Australia                 2
5              EIRE                 2
9             Japan                 2
6           Finland                 1
1           Belgium                 1
10      Netherlands                 1
11           Norway                 1
4           Denmark                 1
13        Singapore                 1
3            Cyprus                 1
15           Sweden                 1
2   Channel Islands                 1

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [169]:
total_sales_country = pd.merge(total_sales, orders, how='inner', on = 'CustomerID').reset_index()

condition= (total_sales_country['Category']!= 'others')
total_sales_country[condition]

total_sales_country_agg=total_sales_country[condition].groupby(["Country"])["CustomerID"].nunique().reset_index(name='Unique_Customers').sort_values(by=('Unique_Customers'), ascending=False)
total_sales_country_agg

            Country  Unique_Customers
26   United Kingdom               932
10          Germany                39
9            France                29
2           Belgium                12
25      Switzerland                 9
23            Spain                 9
21         Portugal                 7
19           Norway                 7
14            Italy                 5
8           Finland                 5
15            Japan                 4
0         Australia                 4
5            Cyprus                 4
4   Channel Islands                 4
1           Austria                 3
7              EIRE                 3
6           Denmark                 3
24           Sweden                 2
13           Israel                 2
12          Iceland                 1
11           Greece                 1
16          Lebanon                 1
17            Malta                 1
18      Netherlands                 1
20           Poland                 1
22        Singapore                 1
3            Canada                 1